<a href="https://colab.research.google.com/github/Jwaminju/Algorithm_01/blob/main/Python_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%8B%9C%EA%B0%81%ED%99%94_Python_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%A0%84%EC%B2%98%EB%A6%AC_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

데이터 전처리
- 컬럼 행 삭제, 추가

In [1]:
import pandas as pd

In [3]:
 df = pd.DataFrame(data={'val0':['a', 'b', 'c', 'd'], 'val1': [10, 9, 10, 20], 'val2': [110, 90, 80, 150]},
                   columns = ['val0', 'val1', 'val2'],
                   index = ['x1', 'x2', 'x3', 'x4'])
 df

   val0  val1  val2
x1    a    10   110
x2    b     9    90
x3    c    10    80
x4    d    20   150

In [4]:
df.values

array([['a', 10, 110],
       ['b', 9, 90],
       ['c', 10, 80],
       ['d', 20, 150]], dtype=object)

In [5]:
df.index

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x1 to x4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   val0    4 non-null      object
 1   val1    4 non-null      int64
 2   val2    4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [7]:
df['val1']

x1    10
x2     9
x3    10
x4    20
Name: val1, dtype: int64

In [8]:
df.val1

x1    10
x2     9
x3    10
x4    20
Name: val1, dtype: int64

컬럼명 마지막에 '.'이 있거나, 컬럼명 안에 공백이 있는 경우 데이터명.컬럼명은 사용불가

# 컬럼 추가

전체 단일값으로 추가

In [9]:
df['val3'] = 1
df

   val0  val1  val2  val3
x1    a    10   110     1
x2    b     9    90     1
x3    c    10    80     1
x4    d    20   150     1

각각 다른 값으로 추가

In [10]:
df['val4'] = 1, 2, 3, 4

In [11]:
df

   val0  val1  val2  val3  val4
x1    a    10   110     1     1
x2    b     9    90     1     2
x3    c    10    80     1     3
x4    d    20   150     1     4

In [12]:
df['val5'] = 'a', 'b', 'c', 'd'
df

   val0  val1  val2  val3  val4 val5
x1    a    10   110     1     1    a
x2    b     9    90     1     2    b
x3    c    10    80     1     3    c
x4    d    20   150     1     4    d

규모가 큰 데이터를 추가 -> range 함수 사용

In [13]:
list(range(1, 10, 2))

[1, 3, 5, 7, 9]

In [14]:
list(range(10, 1, -2))

[10, 8, 6, 4, 2]

In [16]:
df['val6'] = list(range(1, 5))
df

   val0  val1  val2  val3  val4 val5  val6
x1    a    10   110     1     1    a     1
x2    b     9    90     1     2    b     2
x3    c    10    80     1     3    c     3
x4    d    20   150     1     4    d     4

연산으로 칼럽 추가

In [17]:
df['합계'] = df['val1'] + df['val2']

In [18]:
df

   val0  val1  val2  val3  val4 val5  val6   합계
x1    a    10   110     1     1    a     1  120
x2    b     9    90     1     2    b     2   99
x3    c    10    80     1     3    c     3   90
x4    d    20   150     1     4    d     4  170

In [19]:
df['평균'] = df['합계']/2

In [20]:
df

   val0  val1  val2  val3  val4 val5  val6   합계    평균
x1    a    10   110     1     1    a     1  120  60.0
x2    b     9    90     1     2    b     2   99  49.5
x3    c    10    80     1     3    c     3   90  45.0
x4    d    20   150     1     4    d     4  170  85.0

Result1이라는 컬럼을 생성
- val2 컬럼의 데이터 중 100보다 크면 True, 아니면 False

In [21]:
df['val2'] > 100

x1     True
x2    False
x3    False
x4     True
Name: val2, dtype: bool

In [26]:
df.result = df['val2'] > 100  # 이 경우는 존재하는 컬럼만 가능함
df

   val0  val1  val2  val3  val4 val5  val6   합계    평균
x1    a    10   110     1     1    a     1  120  60.0
x2    b     9    90     1     2    b     2   99  49.5
x3    c    10    80     1     3    c     3   90  45.0
x4    d    20   150     1     4    d     4  170  85.0

In [29]:
df.val4 = df['val2'] > 100
df

   val0  val1  val2   val3   val4 val5  val6   합계    평균
x1    a    10   110   True   True    a     1  120  60.0
x2    b     9    90  False  False    b     2   99  49.5
x3    c    10    80  False  False    c     3   90  45.0
x4    d    20   150   True   True    d     4  170  85.0

# 컬럼 삭제

In [32]:
del df.val3 # 점 기호는 존재하는 것을 선택할 때만 가능하다

AttributeError: ignored

In [33]:
del df['val3']
df

KeyError: ignored

## 행 선택

인덱싱 방법이 다양하다, 버전 업데이트 시 행 인덱싱 방법이 달라질 수 있다

In [35]:
df['x1':'x3']

   val0  val1  val2   val4 val5  val6   합계    평균
x1    a    10   110   True    a     1  120  60.0
x2    b     9    90  False    b     2   99  49.5
x3    c    10    80  False    c     3   90  45.0

In [36]:
df[0:3]

   val0  val1  val2   val4 val5  val6   합계    평균
x1    a    10   110   True    a     1  120  60.0
x2    b     9    90  False    b     2   99  49.5
x3    c    10    80  False    c     3   90  45.0

# 행열조작 고급

loc:  # label-location
 - 행 또는 컬럼의 이름으로 선택
 - 컬럼 이름의 경우 생략이 가능하나, 행 이름의 정보는 필수적이다

iloc:  # index-label-location
 - 행 또는 컬럼의 인덱스 번호로 선택
 - 컬럼의 경우 생략이 가능하나, 행의 정보는 필수적이다

In [38]:
df.loc['x1']

val0       a
val1      10
val2     110
val4    True
val5       a
val6       1
합계       120
평균        60
Name: x1, dtype: object

In [39]:
df.loc['x1', 'val1']

10

In [41]:
df.loc['x1', ['val1', 'val2']]

val1     10
val2    110
Name: x1, dtype: object

In [42]:
df.loc['x1':'x3']

   val0  val1  val2   val4 val5  val6   합계    평균
x1    a    10   110   True    a     1  120  60.0
x2    b     9    90  False    b     2   99  49.5
x3    c    10    80  False    c     3   90  45.0

In [43]:
df.loc['x1':'x3', 'val1']

x1    10
x2     9
x3    10
Name: val1, dtype: int64

In [44]:
df.loc['x1':'x3', ['val1', 'val2']]

    val1  val2
x1    10   110
x2     9    90
x3    10    80

In [45]:
df.loc['x1':'x3', 'val1':'val4']

    val1  val2   val4
x1    10   110   True
x2     9    90  False
x3    10    80  False

In [46]:
df.iloc[:,:]

   val0  val1  val2   val4 val5  val6   합계    평균
x1    a    10   110   True    a     1  120  60.0
x2    b     9    90  False    b     2   99  49.5
x3    c    10    80  False    c     3   90  45.0
x4    d    20   150   True    d     4  170  85.0

In [47]:
df.iloc[1]

val0        b
val1        9
val2       90
val4    False
val5        b
val6        2
합계         99
평균       49.5
Name: x2, dtype: object

# 행 추가

결측치도 추가하겠음 (missing value)
결측치를 생성하기 위해서는 numpy를 활용해야함

In [48]:
import numpy as np

In [49]:
np.nan # np.NaN

nan

In [51]:
df.loc['x9'] = ['b', 7, 100, np.nan, np.nan, np.nan, np.nan, np.nan] # 열의 개수에 맞게 추가해야함

In [53]:
df #  결측치를 사용하면 좋은 점은 열의 데이터 타입이 어떤 것이던지 결측치를 넣을 수 있다

   val0  val1  val2  val4 val5  val6     합계    평균
x1    a    10   110   1.0    a   1.0  120.0  60.0
x2    b     9    90   0.0    b   2.0   99.0  49.5
x3    c    10    80   0.0    c   3.0   90.0  45.0
x4    d    20   150   1.0    d   4.0  170.0  85.0
x9    b     7   100   NaN  NaN   NaN    NaN   NaN

In [55]:
df.loc['x10'] = ['b', 7, 100, np.nan, np.nan, np.nan, np.nan, 'NaN']

In [56]:
df #  조심해야할 것은 NaN이 문자인 경우이다

    val0  val1  val2  val4 val5  val6     합계    평균
x1     a    10   110   1.0    a   1.0  120.0    60
x2     b     9    90   0.0    b   2.0   99.0  49.5
x3     c    10    80   0.0    c   3.0   90.0    45
x4     d    20   150   1.0    d   4.0  170.0    85
x9     b     7   100   NaN  NaN   NaN    NaN   NaN
x10    b     7   100   NaN  NaN   NaN    NaN   NaN

In [57]:
df.tail()

    val0  val1  val2  val4 val5  val6     합계    평균
x2     b     9    90   0.0    b   2.0   99.0  49.5
x3     c    10    80   0.0    c   3.0   90.0    45
x4     d    20   150   1.0    d   4.0  170.0    85
x9     b     7   100   NaN  NaN   NaN    NaN   NaN
x10    b     7   100   NaN  NaN   NaN    NaN   NaN

In [58]:
df.head()

   val0  val1  val2  val4 val5  val6     합계    평균
x1    a    10   110   1.0    a   1.0  120.0    60
x2    b     9    90   0.0    b   2.0   99.0  49.5
x3    c    10    80   0.0    c   3.0   90.0    45
x4    d    20   150   1.0    d   4.0  170.0    85
x9    b     7   100   NaN  NaN   NaN    NaN   NaN